import React from 'react';
// import githubLogo from '../img/github_log.jpeg';
// import tistoryLogo from '../img/Tistory_logo.png';
import './App.css';

const Menu = () => (
  <div id="menu">
    <a href="page1.html"><b>page1</b></a>
    <a href="page2.html"><b>page2</b></a>
    <a href="page3.html"><b>page3</b></a>
    <a href="page4.html"><b>page4</b></a>
    <a href="page5.html"><b>page5</b></a>
    <a href="about.html">ABOUT</a>
    <a href="Last.html">Last</a>
    <a href="education.html">EDUCATION</a>
  </div>
);

const AboutMe = () => (
  <div className="aboutMe">
    <p>멋쟁이사자를 지원하게 된 동기는 학기중에 내가 배운 언어와 지식들을 프로젝트로 진행했을 때 얼마나 할 수 있을지 확인해보고 싶었고 평소에 관심있었던 앱/웹을 다른 분들과 같이 제작을 하였을 때 가질 수 있는 내 이력서가 될 수 있기 때문에 멋쟁이사자 활동을 해보고 싶다는 생각이 들게 되었습니다. 이번 방학 때 Clover 디자인 팀과 협업을 하여 웹사이트를 제작했었는데  프로젝트를 진행하면서 프론트엔드에 관심이 생겼고 더 많은 프로젝트를 다양한 사람들과 함께 진행해보고 싶다는 생각이 들었습니다.  주위에 연합동아리로 활동을 하고 있는 사람들의 github아이디를 검색해서 어떤 프로젝트를 하고있나 탐색해봤는데 프로젝트는 물론 알고리즘 공부등 다양한 활동을 하고 있는 것 같아서 좋아보였습니다.
      일단 MBTI로 저를 소개하자면 INFP입니다. 내성적이라 처음엔 어색할 수 있지만 친해지면 어색함이 사라지고 항상 열정적으로 임할 생각입니다. 내 의견만 내세우는 편이 아닌, 다른 사람의 의견을 잘 들어주고 좋아하는 일에 열정이 높아지기 때문에 잘할 수 있을 것 같습니다. 또한 다른 사람들에 비해 창의력도 있는 편이라고 생각합니다. 많이 부족할 수는 있지만 멋쟁이사자 활동을 통해 배우면서 함께 성장할 수 있는 시간이 되었으면 좋겠습니다. 멋쟁이사자 모든 과정을 수료하고 끝났을 때 어떤 성과물, 발전을 했을지는 모르겠지만 그것을 하는 과정에서 항상 최선을 다하도록 노력하도록 하겠습니다. 저는 학기 과목을 수강하면서 백엔드 쪽보다는 프론트엔드 쪽이 좀 더 흥미가 생겻던 것 같습니다. 웹 프로그래밍이라는 과목을 수강할 때 웹을 제작하고 디자인 하는 것이 다른 과목을 수강할 때보다 좋았던 것 같습니다. 하지만 아직 웹/앱에 대한 경험들이 부족하기 때문에 모르는 모듈, 언어들이 많았습니다. 이를 해결하기 위해 연합동아리에 들어가서 다양한 프로젝트를 하며 실무경험을 쌓아보자라는 생각이 들어서 멋쟁이사자에 지원하게 되었습니다.</p>
  </div>
);
const Page1 = () => (
  <div class="aboutMe">
    <p>1. 저희 멋쟁이사자처럼 12기에 지원해 주심에 감사드리며, 지원자분의 지원 동기를 올해의 목표와 연관 지어 서술해 주세요.</p>
    <p>멋쟁이사자를 지원하게 된 동기는 학기중에 내가 배운 언어와 지식들을 프로젝트로 진행했을 때 얼마나 할 수 있을지 확인해보고 싶었고 평소에 관심있었던 앱/웹을 다른 분들과 같이 제작을 하였을 때 가질 수 있는 내 이력서가 될 수 있기 때문에 멋쟁이사자 활동을 해보고 싶다는 생각이 들게 되었습니다. 이번 방학 때 Clover 디자인 팀과 협업을 하여 웹사이트를 제작했었는데  프로젝트를 진행하면서 프론트엔드에 관심이 생겼고 더 많은 프로젝트를 다양한 사람들과 함께 진행해보고 싶다는 생각이 들었습니다.  주위에 연합동아리로 활동을 하고 있는 사람들의 github아이디를 검색해서 어떤 프로젝트를 하고있나 탐색해봤는데 프로젝트는 물론 알고리즘 공부등 다양한 활동을 하고 있는 것 같아서 좋아보였습니다.
      일단 MBTI로 저를 소개하자면 INFP입니다. 내성적이라 처음엔 어색할 수 있지만 친해지면 어색함이 사라지고 항상 열정적으로 임할 생각입니다. 내 의견만 내세우는 편이 아닌, 다른 사람의 의견을 잘 들어주고 좋아하는 일에 열정이 높아지기 때문에 잘할 수 있을 것 같습니다. 또한 다른 사람들에 비해 창의력도 있는 편이라고 생각합니다. 많이 부족할 수는 있지만 멋쟁이사자 활동을 통해 배우면서 함께 성장할 수 있는 시간이 되었으면 좋겠습니다. 멋쟁이사자 모든 과정을 수료하고 끝났을 때 어떤 성과물, 발전을 했을지는 모르겠지만 그것을 하는 과정에서 항상 최선을 다하도록 노력하도록 하겠습니다. 저는 학기 과목을 수강하면서 백엔드 쪽보다는 프론트엔드 쪽이 좀 더 흥미가 생겻던 것 같습니다. 웹 프로그래밍이라는 과목을 수강할 때 웹을 제작하고 디자인 하는 것이 다른 과목을 수강할 때보다 좋았던 것 같습니다. 하지만 아직 웹/앱에 대한 경험들이 부족하기 때문에 모르는 모듈, 언어들이 많았습니다. 이를 해결하기 위해 연합동아리에 들어가서 다양한 프로젝트를 하며 실무경험을 쌓아보자라는 생각이 들어서 멋쟁이사자에 지원하게 되었습니다.</p>
  </div>
);

const Page2 = () => (
  <div class="aboutMe">
  <p>2. 나의 한계점을 극복하기 위해 노력하여 달성해 본 경험을 문제-과정(노력)-목표 달성의 이야기로 서술해 주세요.</p>
  <p>처음 react를 시작할 때 애니메이션 효과를 구현하는 과정은 쉽지 않았던 것 같습니다. react가 처음이기도 했고, 애니메이션을 구현하기 위해서 그 안에 적용되는 효과들을 모두 구현해야하는데 어떻게 이것을 완성할 수 있을까? 라는 문제가 있었습니다. 저는 이를 해결하기 위해 react를 따로 공부했던 것도 아니고 다른사람들의 코드를 보며 이런 상황에서는 이렇게 만들고 저런 상황에서는 저렇게 만들면 되는구나라는 생각이 들었습니다. 또 도움이 많이되었던 것은 GPT, Bing, Bard 모든 Ai에게 질의를 던지며 Ai가 주는 답변을 통해 구현을 할 수 있었습니다. 제가 사용해본 결과 Ai가 완벽하진 않기 때문에 내가 원하는 옵션을 모두 맞추진 못합니다. 그러나 Ai가 틀을 잡아주는 것에 다른사람의 코드를 익히고 응용을 하였더니 원하는 결과를 만들 수 있었습니다. 지금 Ai는 계속해서 발전하고 있지만 아직 완벽하진 않습니다. 실무에서 얼마나 더 빠르고 정확하게 내가 원하는 값을 만드냐는 Ai를 얼마나 잘 다르고 사용할 줄 아는지가 중요하다고 생각합니다. 이번에 멋쟁이사자에 합격한다면  프로젝트를 통해 Ai의 활용 및 응용을 해서 실무에서 활용할 수 있는 나만의 실력을 키우고 싶다는 생각이 들었습니다.</p>
  <h3>
    <strong>아래에 이미지를 클릭하면 저의 github홈페이지, 운영중인 tistory블로그로 이동합니다. </strong>
  </h3>
</div>
);

const Page3 = () => (
  <div class="aboutMe">
  <p>3. 이번 멋쟁이사자처럼 12기 활동을 통해서 얻어 가고 싶은 것을 말씀해 주세요.
  </p>
  <p>요즘 AI가 핫하기 때문에 인공지능을 활용하여 웹툰앱을 개발해보고 싶습니다. 최근 인공지능이 그림은 물론, 디자인까지 할 수 있으며 실제 사람이 한 것과 알아보기 힘든 수준으로 발전을 했다고 들었습니다. 그렇기 때문에 인공지능을 활용해서 웹툰을 제작하고 인공지능의 기술을 가져와서 Ai가 자동으로 만들어주는 웹 프로그램 서비스를 만들어 보고 싶습니다.  제가 생각해본 아이디어인데 카메라로 동영상을 찍었을 때 그 파일을 인공지능이 인식해서 만화로 바꿔주는 앱을 만들어보면 어떨까? 라는 생각을 해보았습니다. 여기까지 성공한다면 인간의 목소리를 녹음하여 연예인이든 만화캐릭터든 목소리를 변조하여 입히면 다른 웹툰 사이트와는 차별화된 앱을 만들 수 있다고 생각했습니다. 물론 구현은 어려워보이지만 구현하면서 얻게되는 것이 많을 것이라고 생각합니다. 평소에도 만들어보고 싶은 웹들은 많았는데 이번기회에 좋은 서비스를 만들어 보고 싶습니다.
  </p>
  <h3>
    <strong>아래에 이미지를 클릭하면 저의 github홈페이지, 운영중인 tistory블로그로 이동합니다. </strong>
  </h3>
</div>
);

const Page4 = () => (
  <div class="aboutMe">
  <p>4. 웹 개발자의 입장에서 평소에 사용하는 서비스에서 개선하면 좋겠다고 생각했던 점이 있다면 말씀해 주세요.</p>
  <p>저는 웹사이트를 3명의 프론트엔드 개발자들과 서로 브렌치를 파서 작업을 하였고, 병합하는 과정에서 Css충돌이 있었습니다. 내가 만든 브렌치에서는 분명히 정상적으로 작동하던 이미지파일, mp4파일, 음성파일 등이 병합만 하면 이미지가 깨지고 사라지는 문제가 발생했습니다. 무슨 문제때문에 병합을 할 때 오류가 생기는 걸까? 코드를 하나하나 뜯어보니 서로가 사용하고 있는 classname의 속성이 동일할 때 다른 페이지에도 그 classname이 가진 속성들을 가져와서 문제가 발생하고 있었습니다. 이러한 문제를 해결하기 위해 Css속성을 부여할 때는 import styles from “” 이런식으로 만들어야지 발생하는 오류를 최소화하여 진행할 수 있겠다라는 것을 깨달았습니다. 프론트엔드를 하면서 느낀건데 확실히 재미있지만 이러한 부분에 대해서는 어디에서 정확히 오류가 발생할 지 알려주지 않기 때문에 초반에 설계를 하는 작업이 중요하다는 것을 깨달았던 것 같습니다. 그래서 웹 개발자의 입장에서 이러한 오류를 잡아주고 개선방향을 알려주는 프로그램을 Ai를 활용하여 만들어보면 개선되지 않을까? 라는 생각을 해봤습니다.</p>
  <h3>
    <strong>아래에 이미지를 클릭하면 저의 github홈페이지, 운영중인 tistory블로그로 이동합니다. </strong>
  </h3>
</div>
);

const Page5 = () => (
  <div class="aboutMe">
  <p>5. 왜 프론트엔드 파트를 선택하게 되었고 본인이 생각하는 프로젝트 내에서 프론트엔드 파트의 역할을 말씀해주세요.</p>
  <p>프론트엔드를 가야할지 백엔드를 가야할지 고민이 많았습니다. 이번 방학에 Clover라는 디자인 연합동아리가 웹사이트를 만들어달라는 제안을 하였고 함께 협업을 하며 웹 디자인, 모바일 디자인을 하면서 백엔드를 할 때는 느낄 수 없었던 즐거움이 있었습니다. 프론트엔드는 내가 작업하는 것을 실시간으로 볼 수 있기 때문에 성취감이 배로 오는 것 같았고 시간가는 줄 몰랐습니다. 물론 프론트엔드에 대해 경험이 많지 않았기에 어려움이 없었던 것은 아니지만 인공지능, 다른 사람들이 만들었던 웹사이트들을 참고하며 개발을 하였더니 수월하게 협업을 마칠 수 있었던 것 같습니다. 이번에 React를 활용한다고 들었던 것 같은데 부족하지만 합격한다면 열심히 해보고 싶습니다.
    저는 프로젝트 내에서 프론트엔드 파트의 역할은 디자이너가 만든 디자인을 프론트엔드 서버에 형태를 추출하고 화면을 만든 뒤, 조작할 수 있도록 만들어주는 역할이라고 생각합니다. 그렇기에 백엔드가 작업하고 위해 프론트엔드는 웹구현을 빠르게 하는 것이 중요하다고 생각하고 있습니다. 프론트엔드를 시작한지 얼마되지 않아 모르는 모듈, 언어들이 많지만 다양한 경험을 통해 모든 것을 성취해보도록 노력하겟습니다.</p>
  <h3>
    <strong>아래에 이미지를 클릭하면 저의 github홈페이지, 운영중인 tistory블로그로 이동합니다. </strong>
  </h3>
</div>
);
const Last = () => (
    <div class="aboutMe">
      <p>왜 프론트엔드 파트를 선택하게 되었고 본인이 생각하는 프로젝트 내에서 프론트엔드 파트의 역할을 말씀해주세요.</p>
      <p>프론트엔드를 가야할지 백엔드를 가야할지 고민이 많았습니다. 이번 방학에 Clover라는 디자인 연합동아리가 웹사이트를 만들어달라는 제안을 하였고 함께 협업을 하며 웹 디자인, 모바일 디자인을 하면서 백엔드를 할 때는 느낄 수 없었던 즐거움이 있었습니다. 프론트엔드는 내가 작업하는 것을 실시간으로 볼 수 있기 때문에 성취감이 배로 오는 것 같았고 시간가는 줄 몰랐습니다. 물론 프론트엔드에 대해 경험이 많지 않았기에 어려움이 없었던 것은 아니지만 인공지능, 다른 사람들이 만들었던 웹사이트들을 참고하며 개발을 하였더니 수월하게 협업을 마칠 수 있었던 것 같습니다. 이번에 React를 활용한다고 들었던 것 같은데 부족하지만 합격한다면 열심히 해보고 싶습니다.
        저는 프로젝트 내에서 프론트엔드 파트의 역할은 디자이너가 만든 디자인을 프론트엔드 서버에 형태를 추출하고 화면을 만든 뒤, 조작할 수 있도록 만들어주는 역할이라고 생각합니다. 그렇기에 백엔드가 작업하고 위해 프론트엔드는 웹구현을 빠르게 하는 것이 중요하다고 생각하고 있습니다. 프론트엔드를 시작한지 얼마되지 않아 모르는 모듈, 언어들이 많지만 다양한 경험을 통해 모든 것을 성취해보도록 노력하겟습니다.</p>
      <h3>
        <strong>아래에 이미지를 클릭하면 저의 github홈페이지, 운영중인 tistory블로그로 이동합니다. </strong>
      </h3>
    </div>
);

const Education = () => (
  <div class="resume">
  <img src="../img/명지대로고.jpg" width="50%" />
  <p><strong>현재 재학중(3학년)</strong></p>
</div>
);

const ClickButton = () => (
<div id="clickButton">
      <div id="clickButton1">
        <a href="https://github.com/youminki">
        <img src="../img/github_log.jpg" width="50%" />
        </a>
        </div>
      <div id="clickButton2">
        <a href="https://dbalsrl7648.tistory.com/">
        <img src="../img/Tistory_logo.png" width="50%" />
        </a>
      </div>
  </div>
);

function App() {
  return (
    <div className="App">
      <Menu />
      <h1>멋쟁이사자 자기소개서</h1>
      <p>1. 저희 멋쟁이사자처럼 12기에 지원해 주심에 감사드리며, 지원자분의 지원 동기를 올해의 목표와 연관 지어 서술해 주세요.</p>
      <AboutMe />
      <h1>멋쟁이사자 자기소개서</h1>
      <Page1 />
      <Page2 />
      <Page3 />
      <Page4 />
      <Page5 />
      <Last />
      <Education />
      <ClickButton />
    </div>
  );
}

export default App;
